app/controllers/blogs_controller.rb

  def index
     # 記事を全件取得
    @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def show
    @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    blog = Blog.new(blog_params)
    blog.save
---
INSERT INTO "blogs" ("title", "category", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "title1"], ["category", "category1"], ["body", "honbun1"], ["created_at", "2020-02-27 09:32:59.902556"], ["updated_at", "2020-02-27 09:32:59.902556"]]

  def edit
    @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]